# Database Admin with Python

## Import Libraries

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:d2!obH4d@localhost/new_db"

In [3]:
engine = create_engine(connection_str)
engine

Engine(mysql+pymysql://root:***@localhost/new_db)

In [4]:
create_database(connection_str)

In [5]:
database_exists(connection_str)

True

In [7]:
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

In [8]:
import pandas as pd
df = pd.read_csv('data/Tshirt.csv')
df.head()

  Size  Color  Cost Sold
0    S   Blue  5.00    Y
1    M    Red  7.49    Y
2    M  Green  8.00    N
3   XL  Green  4.00    N
4    L    Red  9.99    Y

In [9]:
df.to_sql('tshirts', engine, if_exists = 'replace')

In [10]:
q = """SELECT * FROM tshirts LIMIT 5;"""
pd.read_sql(q, engine)

   index Size  Color  Cost Sold
0      0    S   Blue  5.00    Y
1      1    M    Red  7.49    Y
2      2    M  Green  8.00    N
3      3   XL  Green  4.00    N
4      4    L    Red  9.99    Y

In [11]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_new_db
0          tshirts